[{"cat_clean":"Accounting & Revenue recognition","cat_raw":"Accounting &amp; Revenue recognition","cat_id":"3","url":"https:\/\/www.commercesync.com\/stripe\/","name":"Commerce Sync","desc":"Commerce Sync enables you to connect your Stripe account to Xero and Quickbooks Online.","text":"Automatic daily sales transfers\nCommerce Sync will transfer all of your sales information every day. Plus, there are no limits on the number of transfers you can have each month.\nSimple activation \nWith just a few clicks, you’ll be ready to eliminate manual data entry and start transferring your daily sales.\nDaily sales summary\nYour sales information will transfer as one invoice that captures all sales for the day, with taxes reported as separate line items.\nYour data your way \nCustomize your sync to get the sales information you need, the way you need it.\nFees\nCredit card fees are subtracted from the daily sales information and tracked in an expense account of your choosing.\nRefunds \nFull or partial refunds are transferred as individual records to simplify reconciliation.\nQuestion: Which accounting solutions are currently supported?\nAnswer: Xero, QuickBooks Online, QuickBooks for Windows (Desktop) Pro, Premier, and Enterprise 2009 or later.\nQuestion: Will I have to sign a contract?\nAnswer: Never. Payments are made month by month unless you choose to take advantage of the discount offered in our annual subscription plans. Of course, you can cancel at any time.\nQuestion: When will I be billed?\nAnswer: Billing will begin at the end of your free trial period, plus we'll send you an email three days before billing begins to remind you!\nQuestion: Can I cancel my subscription?\nAnswer: Of course, but we hate to see you go! For monthly plans, there are no contracts and you can cancel your account at any time. For annual plans, you can cancel your account any time up to one business day before your renewal date.\n"},{"cat_clean":"Accounting & Revenue recognition","cat_raw":"Accounting &amp; Revenue recognition","cat_id":"3","url":"https:\/\/www.connexforquickbooks.com\/","name":"Connex","desc":"Connex syncs customers, products, and orders between your order management solution and QuickBooks Pro, Premier, Wholesale and Manufacturing, or Enterprise.","text":"Connex for QuickBooks syncs customers, products, and orders between your order management solution and QuickBooks Pro, POS, Premier, Wholesale and Manufacturing, or Enterprise. Connex can sync orders from QuickBooks into select order management solutions. Connex supports QuickBooks in the U.S., U.K., and Canada.\n Connex can push pricing and inventory updates to your sales channels from QuickBooks. When you configure our software, click the inventory tab to set-up the sync. Please note there is a fifteen to twenty minute delay in syncing updates.\n To get started, register for an account. If you are a trial user, signing into Connex for QuickBooks for the first time will activate a seven day trial. For more info on trials, read this article.\n If you are an Amazon customer, check out our new Amazon profit and loss report. It summarizes Amazon fees, unit cost, and displays ROI.\n If you are a QuickBooks Online user, please use Cloud Cart Connector.\nIf you need help configuring Connex for QuickBooks, please visit our support center. If you have any questions, please submit a ticket.\n To see customer testimonials about our sister product, the Cloud Cart Connector for QuickBooks Online, please visit the Intuit App Center.\n"},{"cat_clean":"Accounting & Revenue recognition","cat_raw":"Accounting &amp; Revenue recognition","cat_id":"3","url":"http:\/\/support.cloudcartconnector.com\/hc\/en-us\/articles\/203281875","name":"Cloud Cart Connector","desc":"Cloud Cart Connector enables you to easily sync customers, products, and orders with QuickBooks Online.","text":"Stripe Fees\nCloud Cart can add credit card fees on each order. For more details, read these instructions.\nShould I sync with Stripe or my website?\nIn some cases, our client's website is missing code to send Stripe order details. We recommend syncing with your website directly, if it is one of our supported platforms.\nAs a workaround, you can map the unit price to the name field in QB.\nPairing\nYou must login to Stripe through our app, then configure your settings. Here are the steps:\nStripe Total\nIn many cases, Stripe fails to receive the SKUs on an order. As a result, Cloud Cart Connector has no order details. You will see a line item called StripeTotal in QuickBooks. Here is what our system receives:\nIf you need order details, we recommend syncing with your online store directly.\nLocation Mapping\nYou can easily map the Stripe order description field to the QBO location area. At the configure page, go to the field mapping tab. Choose description. \nDemo\nHere is a demo of the integration:\n"},{"cat_clean":"Accounting & Revenue recognition","cat_raw":"Accounting &amp; Revenue recognition","cat_id":"3","url":"http:\/\/www.godaddy.com\/accounting\/accounting-software.aspx","name":"GoDaddy","desc":"GoDaddy enables you to connect your Stripe account to simplify bookkeeping.","text":"You can’t have a website without a domain name. Like a street address that tells people where you live, a domain helps customers drive directly to your website. We can help you find one you’ll love.\nA website is vital to any modern business. Even if you sell locally or by word of mouth, your customers are looking for you on the web – if only to check your hours. Find everything you need here.\nHosting is what makes your site visible on the web. We offer fast, reliable plans for every need - from a basic blog to high-powered site. Designer? Developer? We've got you covered too.\nFor your business to succeed, customers need to trust that you'll protect them from viruses, hackers and identity thieves. Count on our security products to keep your website secure, your visitors safe and your business growing.\nEven the best products go unsold if customers don’t know where to find them. Give your business the attention it deserves with promotional tools that attract visitors and keep them coming back. \nLooking for our best deals? You're in the right place. All of our special offers are right here, along with deep discounts from partners who are dedicated to helping your business succeed.\nEliminate tedious data entry. Automate sales and expense.   \nGoDaddy Bookkeeping imports and organizes all of your business accounts together and generates income and expense reports. Login with any computer or mobile device, and your profit and loss will be updated and waiting for you.\n There is nothing to download, install, or update. Ever.\nCustomized, easy, professional invoices in under 5 minutes \n Get paid faster, so you can spend more time doing what you love. Track time spent per customer to understand costs, or to transfer to an invoice to bill. You'll be able to see when an invoice has been viewed or paid, set auto-reminders and even accept payments online.\n Getting paid just got easier.\nPrepare your taxes in minutes, not days\n Every transaction is categorized according to IRS approved Schedule-C tax lines. So as your transactions are being recorded your taxes are being done at the same time. You can see what you owe for annual, sales and estimated taxes 365 days a year.\n Say goodbye to manual entry & piles of paper at tax time.\nSee where you're making money and losing money.\n With all your sales and expense data in one place, it’s easy to see how your business is doing. See who your best customers are, where you’re spending and your sales by state.\nYour data is always at your fingers tips\n Whether you’re on the go, or on the couch, all of your data is just a few clicks away and always up to date — Check sales, account balances, profit and loss and don’t forget mileage tracking. It’s tax deductible.\nGoDaddy uses 256-bit data encryption security, the same as most major U.S. banks.Your data is stored in GoDaddy servers housed in protected facilities with security guards and biometric scanning.\n If your PC ever dies or gets stolen your data is still safe and sound with us.\nWhat makes GoDaddy Online Bookkeeping Essentials different than other online options? Well, besides the fact that it was designed for people who don’t have accounting expertise—it simply does more and costs less. See for yourself how they measure up.   \n“Before GoDaddy bookkeeping—I had no idea what my financial picture looked like . . . because I sell on different sites, use multiple payment processors and have multiple accounts. Bringing them all together in one place, and automatically aggregating it all into one interface—simply amazing! I now know exactly where I am financially.”\n  After signing up, you’re prompted to connect your business accounts (bank, credit card, PayPal, eBay, Amazon, Etsy) to GoDaddy Online Bookkeeping through a secure, read-only connection. Each night, GoDaddy Bookkeeping imports all your transactions, saving you the time and hassle of manual entry. The import process is “read-only,” meaning no changes can be made to your account. Because this application is online, there is no software to install or update. Even if your computer were to crash, all your financial data would be still be safe and accessible on our secure servers.                    \n  GoDaddy works with thousands of banks and credit unions, as well as PayPal, eBay, Amazon and Etsy.                    \n  Absolutely. We use the same security as major U.S. banks (256-bit SSL encryption) to ensure your data is protected against hackers and viruses. Also, we link to your accounts using a read-only connection, meaning we cannot make changes to your accounts.                    \nGoDaddy Online Bookkeeping is designed with the sole proprietor or LLC in mind. It automatically categorizes your transactions into IRS tax categories, so you have a Schedule C worksheet ready to go at tax time – just hand it to your accountant or plug the numbers into your tax software.\n The product also tracks your estimated tax payments due and sales tax collected. If you receive a Form 1099-K, we’ll help you understand how it impacts your taxes. Tax worksheets and reminders are only available in GoDaddy Online Bookkeeping Essentials and Premium.\n  Yes! You can manually enter both cash transactions and mileage, so you can track them in the same place as everything else. Our free Android and iPhone apps lets you enter these transactions on the go and automatically syncs with your online accounts.                    \n  Yes! In GoDaddy Online Bookkeeping Premier, it’s easy to set up and schedule recurring invoices for clients that you need to bill on a regular basis.                    \nGoDaddy Online Bookkeeping is much easier than and less time-consuming than QuickBooks. QuickBooks is a double-entry accounting program that requires accounting knowledge and extensive set up with a chart of accounts. GoDaddy Online Bookkeeping requires no accounting knowledge and there is no software to set up. We only give you what you need to run and manage your business — no feature bloat here!\n GoDaddy Online Bookkeeping is designed with the sole proprietor and LLC business in mind. If you’re a corporation or business with multiple employees, you might consider a system like QuickBooks. But if you’re a smaller business wanting to see where your finances stand and be ready for taxes, you’re in the right place.\n  Yes. Our Android and iPhone apps lets you enter transactions on the go and it automatically syncs with your account, so you’re always up to date.                    \n"},{"cat_clean":"Accounting & Revenue recognition","cat_raw":"Accounting &amp; Revenue recognition","cat_id":"3","url":"http:\/\/integratemybooks.com\/","name":"IntegrateMyBooks","desc":"IntegrateMyBooks is an easy way for you to import data from Stripe into QuickBooks Online.","text":"IntegrateMyBooks instantly imports new Stripe payments in real-time, keeping your                                     QuickBooks account up to date, day and night without you having to do any manual                                     data entry. After a two minute setup, you can relax while our service does all the work.                                 \nAnd, it's only $9 a month.\nTry it free for 14 days with no credit card required.\nSet it and forget it! We'll keep your QuickBooks account up to date                                     instantly and automatically as your Stripe account receives new payments in                                     real-time.\nFor each Stripe payment you receive, we instantly import:\nSimply tell us how far back you want to import and we'll handle the                                     rest.\nTry it out for 14 days, no credit card required.\nTry it risk free for 14 days, no limitations and no credit card required. After                             that, it's only $9 per month.\nIntegrateMyBooks is an automated service that imports data from Stripe into QuickBooks. Import new                     transactions automatically or import your existing transactions with a single click.\n"}]